# Introducción a Pandas
Crear un DataFrame desde un Diccionario

In [233]:
import pandas as pd
import numpy as np

np.random.seed()

diccionario = {
    'Ana': np.random.randint(11, size = 3),
    'Sandra': np.random.randint(11, size = 3),
    'Pedro': np.random.randint(11, size = 3),
    'Juan': np.random.randint(11, size = 3),
    'José': np.random.randint(11, size = 3),
}

data = pd.DataFrame(diccionario, index = ['1er Parcial', '2do Parcial', '3er Parcial'])
data

             Ana  Sandra  Pedro  Juan  José
1er Parcial    4       4      0     3     7
2do Parcial    8      10      8     9     0
3er Parcial    7      10      9     0    10

Transponer los datos.

In [234]:
data = data.T
data

        1er Parcial  2do Parcial  3er Parcial
Ana               4            8            7
Sandra            4           10           10
Pedro             0            8            9
Juan              3            9            0
José              7            0           10

Index o identifficador de cada renglón

In [235]:
data.index

Index(['Ana', 'Sandra', 'Pedro', 'Juan', 'José'], dtype='object')

Encabezado o identificador de cada columna

In [236]:
data.columns

Index(['1er Parcial', '2do Parcial', '3er Parcial'], dtype='object')

In [237]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Ana to José
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   1er Parcial  5 non-null      int32
 1   2do Parcial  5 non-null      int32
 2   3er Parcial  5 non-null      int32
dtypes: int32(3)
memory usage: 272.0+ bytes

In [238]:
data.describe()

       1er Parcial  2do Parcial  3er Parcial
count      5.00000          5.0     5.000000
mean       3.60000          7.0     7.200000
std        2.50998          4.0     4.207137
min        0.00000          0.0     0.000000
25%        3.00000          8.0     7.000000
50%        4.00000          8.0     9.000000
75%        4.00000          9.0    10.000000
max        7.00000         10.0    10.000000

## Selección de datos

In [239]:
data['1er Parcial']

Ana       4
Sandra    4
Pedro     0
Juan      3
José      7
Name: 1er Parcial, dtype: int32

In [240]:
data[['1er Parcial', '2do Parcial']]

        1er Parcial  2do Parcial
Ana               4            8
Sandra            4           10
Pedro             0            8
Juan              3            9
José              7            0

In [241]:
data[data.columns[2]]

Ana        7
Sandra    10
Pedro      9
Juan       0
José      10
Name: 3er Parcial, dtype: int32

In [242]:
data[data['1er Parcial'] == 5]

Empty DataFrame
Columns: [1er Parcial, 2do Parcial, 3er Parcial]
Index: []

In [243]:
data.iloc[0]

1er Parcial    4
2do Parcial    8
3er Parcial    7
Name: Ana, dtype: int32

In [244]:
data['1er Parcial'].iloc[0]

np.int32(4)

In [245]:
data.loc['Pedro']

1er Parcial    0
2do Parcial    8
3er Parcial    9
Name: Pedro, dtype: int32

In [246]:
data['2do Parcial'].loc['Pedro']

np.int32(8)

In [247]:
data.iloc[1:4]

        1er Parcial  2do Parcial  3er Parcial
Sandra            4           10           10
Pedro             0            8            9
Juan              3            9            0

In [248]:
promedio = [data.loc[i].mean() for i in data.index]

data['Promedio'] = promedio
data

        1er Parcial  2do Parcial  3er Parcial  Promedio
Ana               4            8            7  6.333333
Sandra            4           10           10  8.000000
Pedro             0            8            9  5.666667
Juan              3            9            0  4.000000
José              7            0           10  5.666667

In [249]:
data.pop('Promedio')
data

        1er Parcial  2do Parcial  3er Parcial
Ana               4            8            7
Sandra            4           10           10
Pedro             0            8            9
Juan              3            9            0
José              7            0           10

## Agregar y eliminar renglón

In [250]:
calificaciones = np.random.randint(11, size = 3)
data.loc['Jesús'] = calificaciones
data

        1er Parcial  2do Parcial  3er Parcial
Ana               4            8            7
Sandra            4           10           10
Pedro             0            8            9
Juan              3            9            0
José              7            0           10
Jesús             7            5            2

In [251]:
data.drop('Jesús')

        1er Parcial  2do Parcial  3er Parcial
Ana               4            8            7
Sandra            4           10           10
Pedro             0            8            9
Juan              3            9            0
José              7            0           10

## Crar y leer un csv

In [252]:
data.to_csv('data.csv')

In [253]:
pd.read_csv('data.csv')

  Unnamed: 0  1er Parcial  2do Parcial  3er Parcial
0        Ana            4            8            7
1     Sandra            4           10           10
2      Pedro            0            8            9
3       Juan            3            9            0
4       José            7            0           10
5      Jesús            7            5            2